---
kind: type
id: T:Autodesk.Revit.DB.DoorEvacuationExitType
source: html/a847ea7d-a1ea-48ed-e482-c56bb877cc25.htm
---
# Autodesk.Revit.DB.DoorEvacuationExitType

An enumerated type listing the possible door evacuation types

## Syntax (C#)
```csharp
public enum DoorEvacuationExitType
```